import { QestionType } from "../models"

const data:QestionType[] = [
    {
        id:1,
        title:"طراحی وب چیست؟",
        descriptions:` فرآیند ایجاد و توسعه رابط‌های کاربری وب‌سایت‌ها است که شامل طراحی چیدمان صفحات، انتخاب رنگ‌ها، فونت‌ها، تصاویر، و اجزای تعاملی می‌شود. هدف طراحی وب، ایجاد وب‌سایت‌هایی است که هم از نظر زیبایی‌شناسی جذاب باشند و هم تجربه کاربری (UX) ساده و مؤثری را ارائه دهند. طراحی وب شامل استفاده از ابزارها و زبان‌هایی مانند HTML، CSS، و JavaScript است و اغلب با تکنیک‌های ریسپانسیو برای سازگاری با دستگاه‌های مختلف همراه می‌شود.`
    },
    {
        id:2,
        title:"برنامه نویسی وب چیست؟",
        descriptions:`
        برنامه‌نویسی وب فرآیند ساخت و توسعه وب‌سایت‌ها و برنامه‌های تحت وب با 
        استفاده از زبان‌هایی مانند HTML، CSS، JavaScript و زبان‌های سمت سرور مانند Python، PHP یا Node.js است. این فرآیند شامل ایجاد عملکردهای تعاملی، مدیریت داده‌ها و اتصال به سرورها می‌شود.
        برنامه‌نویسی وب فرآیند ساخت و توسعه وب‌سایت‌ها و برنامه‌های تحت وب با 
        استفاده از زبان‌هایی مانند HTML، CSS، JavaScript و زبان‌های سمت سرور مانند Python، PHP یا Node.js است. این فرآیند شامل ایجاد عملکردهای تعاملی، مدیریت داده‌ها و اتصال به سرورها می‌شود.
        برنامه‌نویسی وب فرآیند ساخت و توسعه وب‌سایت‌ها و برنامه‌های تحت وب با 
        استفاده از زبان‌هایی مانند HTML، CSS، JavaScript و زبان‌های سمت سرور مانند Python، PHP یا Node.js است. این فرآیند شامل ایجاد عملکردهای تعاملی، مدیریت داده‌ها و اتصال به سرورها می‌شود.
        `
    },
    {
        id:3,
        title:"ری اکت چیست؟",
        descriptions:`ری‌اکت (React) یک کتابخانه‌ی متن‌باز جاوااسکریپت است که توسط فیسبوک توسعه داده شده و برای ساخت رابط‌های کاربری (UI) استفاده می‌شود. ری‌اکت با استفاده از کامپوننت‌ها، توسعه‌دهندگان را قادر می‌سازد تا بخش‌های مختلف یک اپلیکیشن را به صورت جداگانه طراحی و مدیریت کنند. ویژگی اصلی ری‌اکت، DOM مجازی است که عملکرد سریع‌تر و بهینه‌تری را در به‌روزرسانی صفحات فراهم می‌کند.`
    },
];


export default data