import { CartTypes } from "../models";
import imageUser1 from "../images/chopan-hadi.jpg";
import imageUser2 from "../images/ronaldo.webp";
import imageUser3 from "../images/kiano.jpg";
export const users: CartTypes[] = [
  {
    id: 1,
    imageUrl: imageUser1,
    fullName: "هادی چوپان",
    rols: "بدنساز",
    exp: `  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،`,
  },
  {
    id: 2,
    imageUrl: imageUser2,
    fullName: "رونالدو",
    rols: "فوتبالیست",
    exp: `  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،`,
  },
  {
    id: 3,
    imageUrl: imageUser3,
    fullName: "کیانوریوز",
    rols: "بازیگر",
    exp: `  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،`,
  },
];
